---
author: evitse
title: c
image_url: /images/c_language.jpg
caption: 'Η ανάπτυξη των διεπαφών χρήστη ξεκίνησε με την κλασική διεπαφή χρήστη χαρακτήρων (CUI). Ως προεπιλογή, τα τερματικά των κεντρικών υπολογιστών και των προσωπικών υπολογιστών που βασίζονται στο MS-DOS έχουν CUI. Ένα CUI εμφανίζει δεδομένα μόνο με τη μορφή πεδίων και κειμένων που αποτελούνται από χαρακτήρες και ψηφία. Συνήθως, οι οθόνες έχουν 24 γραμμές 80 χαρακτήρων.
Ένα CUI παρουσιάζει οθόνες στο χρήστη με αλφαριθμητικά δεδομένα σε σταθερές θέσεις. Μέσω του πληκτρολογίου, ο χρήστης μπορεί να προσθέσει νέα δεδομένα στην οθόνη και στη συνέχεια να τα εισαγάγει στον υπολογιστή. Οι εφαρμογές συνήθως τηρούν μια συγκεκριμένη σειρά συνεκτικών οθονών. Ο χρήστης συνήθως δεν μπορεί να εργαστεί ταυτόχρονα με πολλές εφαρμογές. Τα CUI είναι κατάλληλα για εφαρμογές όπως η ηλεκτρονική αίτηση και τροποποίηση των δεδομένων και η απλή επεξεργασία κειμένου.
'
license_url: 'https://pixabay.com/el/%CF%80%CE%B7%CE%B3%CE%B1%CE%AF%CE%BF-%CE%BA%CF%8E%CE%B4%CE%B9%CE%BA%CE%B1-%CE%BA%CF%89%CE%B4%CE%B9%CE%BA%CF%8C%CF%82-583537/'
license_text: kuszapro of pixabay CC0 Creative Commons
categories:
  - method
  - case-study
tags:
  - c
  - Microsoft
  - Windows
  - OS
---


